#!/usr/bin/env python3

# Реализовать программу работы с органическими клетками, состоящими из
# ячеек. Необходимо создать класс Клетка. В его конструкторе
# инициализировать параметр, соответствующий количеству ячеек клетки
# (целое число). В классе должны быть реализованы методы перегрузки
# арифметических операторов: сложение (__add__()), вычитание
# (__sub__()), умножение (__mul__()), деление (__truediv__()). Данные
# методы должны применяться только к клеткам и выполнять увеличение,
# уменьшение, умножение и целочисленное (с округлением до целого)
# деление клеток, соответственно.
# Сложение. Объединение двух клеток. При этом число ячеек общей клетки
# должно равняться сумме ячеек исходных двух клеток.
# Вычитание. Участвуют две клетки. Операцию необходимо выполнять только
# если разность количества ячеек двух клеток больше нуля, иначе выводить
# соответствующее сообщение.
# Умножение. Создаётся общая клетка из двух. Число ячеек общей клетки
# определяется как произведение количества ячеек этих двух клеток.
# Деление. Создаётся общая клетка из двух. Число ячеек общей клетки
# определяется как целочисленное деление количества ячеек этих двух
# клеток.
# В классе необходимо реализовать метод make_order(), принимающий
# экземпляр класса и количество ячеек в ряду. Данный метод позволяет
# организовать ячейки по рядам.
# Метод должен возвращать строку вида *****\n*****\n*****..., где
# количество ячеек между \n равно переданному аргументу. Если ячеек на
# формирование ряда не хватает, то в последний ряд записываются все
# оставшиеся.
# Например, количество ячеек клетки равняется 12, количество ячеек в
# ряду — 5. Тогда метод make_order() вернёт строку: *****\n*****\n**.
# Или, количество ячеек клетки равняется 15, количество ячеек в ряду —
# 5. Тогда метод make_order() вернёт строку: *****\n*****\n*****.
# Подсказка: подробный список операторов для перегрузки доступен по
# ссылке.


class Cell:

    def __init__(self, partition):
        """
        partition: a natural number
        """
        self.partition = partition

    def __add__(self, other):
        return Cell(self.partition + other.partition)

    def __sub__(self, other):
        sub = self.partition - other.partition
        try:
            assert sub > 0
        except AssertionError:
            return 'The cells were annihilated'
        else:
            return Cell(sub)

    def __mul__(self, other):
        return Cell(self.partition * other.partition)

    def __truediv__(self, other):
        return Cell(round(self.partition / other.partition))

    def make_order(self, cols):
        """
        cols: a natural number
        return: a string contains of self.partition number of stars
        """
        div, mod = divmod(self.partition, cols)
        return '\n' + ('*' * cols + '\n') * div + '*' * mod


mushroom = Cell(25)
bacteria = Cell(5)
print((mushroom + bacteria).make_order(8))
print((mushroom - bacteria).make_order(4))
print(bacteria - mushroom)
print((mushroom * bacteria).make_order(16))
print((mushroom / bacteria).make_order(2))
